//Unit3.1 弄清題意，翻成白話文

//Unit3.2 輸入範圍，範圍決定方法
//1.空間限制
//2.時間限制
//3.型態限制
//1. int: -2147483648~2147483647
//2. JS數字: Number.MAX_SAFE_INTEGER
//3. 浮點數精准度問題

//Unit3.3 輸入與輸出方式
//1.以函式為主
//2.以標準輸出為主

// Project3

// 1. LIOJ 1010：靈魂伴侶
// 題目連結：
//https://oj.lidemy.com/problem/1010

// 白話文版本：判斷兩個數字是否相等
// 範圍需要注意的地方：無

// 2. LIOJ 1015：音速小子
// 題目連結：
//https://oj.lidemy.com/problem/1015

// 白話文版本：把一個數字 * 340
// 範圍需要注意的地方：無

// 3. LIOJ 1017：貪婪的小偷
// 題目連結：
//https://oj.lidemy.com/problem/1017

// 白話文版本：取價值最高的 C 項物品
// 範圍需要注意的地方：無
